
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>WonderTrader简介 · WonderTrader-组合盘管理的利器</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="WonderTrader">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"wondertrader","repo":"wondertrader","type":"star","size":"small","count":true}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://wondertrader.github.io" target="_blank" class="custom-link">官网</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    WonderTrader简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    基本用法
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="tutorial.html">
            
                <a href="tutorial.html">
            
                    
                    快速入门
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="install.html">
            
                <a href="install.html">
            
                    
                    如何编译和安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="histdata.html">
            
                <a href="histdata.html">
            
                    
                    历史数据的处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="mystrategy.html">
            
                <a href="mystrategy.html">
            
                    
                    回测自己的策略
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="product.html">
            
                <a href="product.html">
            
                    
                    实盘完整攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    Python API详解
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="structure.html">
            
                <a href="structure.html">
            
                    
                    策略模块详解
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="interfaces.html">
            
                <a href="interfaces.html">
            
                    
                    接口文档
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    使用进阶
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="datakit.html">
            
                <a href="datakit.html">
            
                    
                    数据组件简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="execunit.html">
            
                <a href="execunit.html">
            
                    
                    编写自己的执行单元
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="riskmon.html">
            
                <a href="riskmon.html">
            
                    
                    编写自己的风控模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="moreexchg.html">
            
                <a href="moreexchg.html">
            
                    
                    对接其他交易市场
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="morelan.html">
            
                <a href="morelan.html">
            
                    
                    对接其他语言
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <a target="_blank" href="mailto:wondertrader@126.com">
            
                    
                    wondertrader@126.com
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" >
            
                <a target="_blank" href="https://github.com/wondertrader/wondertrader/">
            
                    
                    Github地址
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >WonderTrader简介</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
                                <section class="normal markdown-section">
                                
                                <p><img src="http://wt.f-sailors.cn/wt/logo_qcode_noad.jpg" alt="WonderTrader2.png"></p>
<h4 id="wondertrader&#x662F;&#x4EC0;&#x4E48;"><em>WonderTrader</em>&#x662F;&#x4EC0;&#x4E48;</h4>
<ul>
<li><code>WonderTrader</code>&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;<code>C++</code>&#x6838;&#x5FC3;&#x6A21;&#x5757;&#x7684;&#xFF0C;&#x9002;&#x5E94;&#x5168;&#x5E02;&#x573A;<strong>&#x5168;&#x54C1;&#x79CD;</strong>&#x4EA4;&#x6613;&#x7684;&#xFF0C;<strong>&#x9AD8;&#x6548;&#x7387;</strong>&#x3001;<strong>&#x9AD8;&#x53EF;&#x7528;</strong>&#x7684;&#x91CF;&#x5316;&#x4EA4;&#x6613;&#x5F00;&#x53D1;&#x6846;&#x67B6;&#x3002;<ul>
<li><strong>&#x9762;&#x5411;&#x4E8E;&#x4E13;&#x4E1A;&#x673A;&#x6784;&#x7684;&#x6574;&#x4F53;&#x67B6;&#x6784;</strong></li>
<li><strong>&#x6570;&#x5341;&#x4EBF;&#x7EA7;&#x7684;&#x5B9E;&#x76D8;&#x7BA1;&#x7406;&#x89C4;&#x6A21;</strong></li>
<li>&#x4ECE;&#x6570;&#x636E;&#x843D;&#x5730;&#x6E05;&#x6D17;&#x3001;&#x5230;&#x56DE;&#x6D4B;&#x5206;&#x6790;&#x3001;&#x518D;&#x5230;&#x5B9E;&#x76D8;&#x4EA4;&#x6613;&#x3001;&#x8FD0;&#x8425;&#x8C03;&#x5EA6;&#xFF0C;<strong>&#x91CF;&#x5316;&#x4EA4;&#x6613;&#x6240;&#x6709;&#x73AF;&#x8282;&#x5168;&#x8986;&#x76D6;</strong></li>
</ul>
</li>
<li><code>WonderTrader</code>&#x4F9D;&#x6258;&#x4E8E;&#x9AD8;&#x901F;&#x7684;<code>C++</code>&#x6838;&#x5FC3;&#x6846;&#x67B6;&#xFF0C;&#x9AD8;&#x6548;&#x6613;&#x7528;&#x7684;&#x5E94;&#x7528;&#x5C42;&#x6846;&#x67B6;&#xFF08;<a href="https://github.com/wondertrader/wtpy" target="_blank">wtpy</a>&#xFF09;&#xFF0C;&#x81F4;&#x529B;&#x4E8E;&#x6253;&#x9020;&#x4E00;&#x4E2A;&#x4ECE;&#x7814;&#x53D1;&#x3001;&#x4EA4;&#x6613;&#x3001;&#x5230;&#x8FD0;&#x8425;&#x3001;&#x8C03;&#x5EA6;&#xFF0C;&#x5168;&#x90E8;&#x73AF;&#x8282;&#x5168;&#x81EA;&#x52A8;&#x4E00;&#x7AD9;&#x5F0F;&#x7684;&#x91CF;&#x5316;&#x7814;&#x53D1;&#x4EA4;&#x6613;&#x573A;&#x666F;&#x3002;</li>
</ul>
<ul>
<li><code>WonderTrader</code>&#x7684;&#x57FA;&#x672C;&#x67B6;&#x6784;&#x56FE;
  <img src="http://wt.f-sailors.cn/wt/structure2.jpg" alt="WonderTrader&#x57FA;&#x672C;&#x67B6;&#x6784;.jpg"></li>
</ul>
<h4 id="wondertrader&#x7684;&#x4F18;&#x52BF;"><code>WonderTrader</code>&#x7684;&#x4F18;&#x52BF;</h4>
<ul>
<li><strong>&#x4E30;&#x5BCC;&#x7684;&#x4EA4;&#x6613;&#x5F15;&#x64CE;</strong><blockquote>
<ul>
<li><strong>CTA&#x5F15;&#x64CE;</strong>&#xFF0C;&#x4E5F;&#x53EB;<strong>&#x540C;&#x6B65;&#x7B56;&#x7565;&#x5F15;&#x64CE;</strong>&#xFF0C;&#x4E00;&#x822C;&#x9002;&#x7528;&#x4E8E;&#x6807;&#x7684;&#x8F83;&#x5C11;&#xFF0C;&#x8BA1;&#x7B97;&#x903B;&#x8F91;&#x8F83;&#x5FEB;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x4E8B;&#x4EF6;+&#x65F6;&#x95F4;&#x9A71;&#x52A8;&#x3002;&#x5178;&#x578B;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x5305;&#x62EC;&#x5355;&#x6807;&#x7684;&#x62E9;&#x65F6;&#x3001;&#x4E2D;&#x9891;&#x4EE5;&#x4E0B;&#x7684;&#x5957;&#x5229;&#x7B49;&#x3002;</li>
<li><strong>SEL&#x5F15;&#x64CE;</strong>&#xFF0C;&#x4E5F;&#x53EB;<strong>&#x5F02;&#x6B65;&#x7B56;&#x7565;&#x5F15;&#x64CE;</strong>&#xFF0C;&#x4E00;&#x822C;&#x9002;&#x7528;&#x4E8E;&#x6807;&#x7684;&#x8F83;&#x591A;&#xFF0C;&#x8BA1;&#x7B97;&#x903B;&#x8F91;&#x8017;&#x65F6;&#x8F83;&#x957F;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x65F6;&#x95F4;&#x9A71;&#x52A8;&#x3002;&#x5178;&#x578B;&#x5E94;&#x7528;&#x573A;&#x666F;&#x5305;&#x62EC;&#x9009;&#x80A1;&#x7CFB;&#x7EDF;&#x3001;&#x591A;&#x56E0;&#x5B50;CTA&#x7B49;&#x3002;</li>
<li><strong>HFT&#x5F15;&#x64CE;</strong>&#xFF0C;&#x4E5F;&#x53EB;<strong>&#x9AD8;&#x9891;&#x7B56;&#x7565;&#x5F15;&#x64CE;</strong>&#xFF0C;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x9AD8;&#x9891;&#x6216;&#x8005;&#x4F4E;&#x5EF6;&#x65F6;&#x7B56;&#x7565;&#xFF0C;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x3002;</li>
</ul>
</blockquote>
</li>
<li><strong>&#x5B8C;&#x5584;&#x7684;&#x5F00;&#x53D1;&#x63A5;&#x53E3;</strong><blockquote>
<ul>
<li><strong>&#x9AD8;&#x6548;&#x6613;&#x7528;&#x7684;&#x6570;&#x636E;&#x63A5;&#x53E3;</strong>&#xFF1A;&#x6BCF;&#x4E2A;&#x7B56;&#x7565;&#x90FD;&#x4F1A;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x6A21;&#x5757;&#xFF0C;&#x4E0A;&#x4E0B;&#x6587;&#x4F1A;&#x81EA;&#x52A8;&#x7F13;&#x5B58;&#x7B56;&#x7565;&#x6240;&#x9700;&#x8981;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7B56;&#x7565;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x5373;&#x53EF;&#x3002;</li>
<li><strong>&#x7B80;&#x6D01;&#x7684;&#x4FE1;&#x53F7;&#x63A5;&#x53E3;</strong>&#xFF1A;&#x7B56;&#x7565;&#x53EA;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x76EE;&#x6807;&#x4ED3;&#x4F4D;&#xFF0C;&#x540E;&#x53F0;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x3002;</li>
<li><strong>&#x4E0A;&#x4E0B;&#x6587;&#x65E0;&#x5173;&#x7684;&#x7B56;&#x7565;&#x903B;&#x8F91;</strong>&#xFF1A;&#x7B56;&#x7565;&#x4E0D;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x8BB0;&#x5F55;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#xFF0C;&#x6BCF;&#x6B21;&#x53EA;&#x9700;&#x8981;&#x5411;&#x63A5;&#x53E3;&#x67E5;&#x8BE2;&#x5373;&#x53EF;&#xFF0C;&#x6570;&#x636E;&#x5168;&#x90E8;&#x7F13;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x8BBF;&#x95EE;&#x6548;&#x7387;&#x6709;&#x4FDD;&#x969C;&#x3002;</li>
</ul>
</blockquote>
</li>
<li><strong>&#x4E13;&#x4E1A;&#x7684;&#x7B56;&#x7565;&#x7BA1;&#x7406;</strong><blockquote>
<ul>
<li><strong>&#x7B56;&#x7565;&#x7EC4;&#x5408;&#x7EDF;&#x4E00;&#x7BA1;&#x7406;</strong>&#xFF1A;&#x91C7;&#x7528;&#x7B56;&#x7565;&#x7EC4;&#x5408;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E3B;&#x8981;&#x4E3A;&#x4E86;&#x914D;&#x5408;&#x4E13;&#x4E1A;&#x673A;&#x6784;&#x7684;&#x4EA7;&#x54C1;&#x7BA1;&#x7406;&#x3002;&#x4E00;&#x4E2A;&#x7EC4;&#x5408;&#x76D8;&#xFF0C;&#x5BF9;&#x5E94;&#x82E5;&#x5E72;&#x4E2A;&#x7B56;&#x7565;&#x7684;&#x82E5;&#x5E72;&#x4E2A;&#x6807;&#x7684;&#xFF0C;&#x518D;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x5355;&#x4F4D;&#x8D44;&#x91D1;&#x91CF;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4EA7;&#x54C1;&#x7BA1;&#x7406;&#x7684;&#x57FA;&#x672C;&#x7EC4;&#x5408;&#x76D8;&#xFF0C;&#x65B9;&#x4FBF;&#x6269;&#x5C55;&#x3002;</li>
<li><strong>&#x76EE;&#x6807;&#x4ED3;&#x4F4D;&#x5408;&#x5E76;&#x6267;&#x884C;</strong>&#xFF1A;&#x76EE;&#x6807;&#x4ED3;&#x4F4D;&#x5408;&#x5E76;&#x4EE5;&#x540E;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x81EA;&#x6210;&#x4EA4;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x540C;&#x65F6;&#x964D;&#x4F4E;&#x4E86;&#x4FDD;&#x8BC1;&#x91D1;&#x5360;&#x7528;&#x548C;&#x4F63;&#x91D1;&#x5F00;&#x9500;&#x3002;</li>
<li><strong>&#x7406;&#x8BBA;&#x90E8;&#x4F4D;&#x72EC;&#x7ACB;&#x5B58;&#x50A8;</strong>&#xFF1A;&#x7B56;&#x7565;&#x7684;&#x7406;&#x8BBA;&#x90E8;&#x4F4D;&#x662F;&#x72EC;&#x7ACB;&#x5B58;&#x50A8;&#x7684;&#xFF0C;&#x7EC4;&#x5408;&#x76D8;&#x7684;&#x6574;&#x4F53;&#x7EE9;&#x6548;&#x4E5F;&#x662F;&#x72EC;&#x7ACB;&#x6838;&#x7B97;&#x7684;&#xFF0C;&#x8F7B;&#x677E;&#x80DC;&#x4EFB;&#x5185;&#x90E8;&#x7BA1;&#x7406;&#x3002;</li>
</ul>
</blockquote>
</li>
<li><strong>&#x5168;&#x7C7B;&#x578B;&#x7684;&#x56DE;&#x6D4B;&#x652F;&#x6301;</strong><blockquote>
<ul>
<li><strong>&#x8BED;&#x8A00;&#x652F;&#x6301;&#x5168;</strong>&#xFF1A;&#x4E0D;&#x8BBA;&#x662F;<code>C++</code>&#x5F00;&#x53D1;&#x7684;&#x7B56;&#x7565;&#x8FD8;&#x662F;<code>wtpy</code>&#x4E0B;&#x5F00;&#x53D1;&#x7684;<code>python</code>&#x7B56;&#x7565;&#xFF0C;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x5B50;&#x6846;&#x67B6;&#x4E0B;&#x5F00;&#x53D1;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x90FD;&#x5728;<strong>&#x7EDF;&#x4E00;&#x7684;&#x56DE;&#x6D4B;&#x5F15;&#x64CE;</strong>&#x4E2D;&#x7EDF;&#x4E00;&#x56DE;&#x6D4B;&#x3002;</li>
<li><strong>&#x56DE;&#x6D4B;&#x6548;&#x7387;&#x9AD8;</strong>&#xFF1A;&#x56DE;&#x6D4B;&#x5F15;&#x64CE;&#x91C7;&#x7528;<code>C++</code>&#x5F00;&#x53D1;&#xFF0C;&#x56DE;&#x6D4B;&#x6548;&#x7387;&#x9AD8;&#xFF0C;&#x901F;&#x5EA6;&#x5FEB;&#x3002;&#x4E0D;&#x7BA1;&#x662F;<code>C++</code>&#x7B56;&#x7565;&#x8FD8;&#x662F;<code>Python</code>&#x7B56;&#x7565;&#xFF0C;&#x90FD;&#x80FD;&#x5FEB;&#x901F;&#x9A8C;&#x8BC1;&#x3002;</li>
<li><strong>&#x7B56;&#x7565;&#x652F;&#x6301;&#x5B8C;&#x5907;</strong>&#xFF1A;&#x9664;&#x4E86;<strong>CTA&#x7B56;&#x7565;</strong>&#x3001;<strong>SEL&#x7B56;&#x7565;</strong>&#x53EF;&#x4EE5;&#x56DE;&#x6D4B;&#xFF0C;<strong>HFT&#x7B56;&#x7565;</strong>&#x548C;<strong>&#x6267;&#x884C;&#x5355;&#x5143;</strong>&#x4E5F;&#x80FD;&#x56DE;&#x6D4B;</li>
</ul>
</blockquote>
</li>
<li><strong>&#x9AD8;&#x6548;&#x7684;&#x6570;&#x636E;&#x4F3A;&#x670D;</strong><blockquote>
<ul>
<li><strong>&#x672C;&#x5730;&#x6570;&#x636E;&#x4F3A;&#x670D;</strong>&#xFF1A;<code>WonderTrader</code>&#x5185;&#x7F6E;&#x7684;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x91C7;&#x7528;&#x672C;&#x5730;&#x5B58;&#x50A8;&#xFF0C;&#x5728;&#x672C;&#x5730;&#x5EFA;&#x7ACB;&#x6570;&#x636E;&#x4F3A;&#x670D;&#xFF0C;&#x901A;&#x8FC7;<code>udp</code>&#x7AEF;&#x53E3;&#x5E7F;&#x64AD;&#x5B9E;&#x65F6;&#x884C;&#x60C5;&#xFF0C;&#x5B9E;&#x73B0;1+N&#x7684;&#x670D;&#x52A1;&#x7ED3;&#x6784;&#xFF0C;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x5411;&#x591A;&#x4E2A;&#x7EC4;&#x5408;&#x76D8;&#x63D0;&#x4F9B;&#x65E0;&#x5DEE;&#x522B;&#x6570;&#x636E;&#x670D;&#x52A1;&#x3002;&#x4E13;&#x4E1A;&#x6570;&#x636E;&#x4F9B;&#x5E94;&#x5546;&#x7EA7;&#x522B;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x652F;&#x6301;&#x642D;&#x5EFA;&#x591A;&#x7EA7;&#x5206;&#x53D1;&#x4F53;&#x7CFB;&#xFF0C;&#x8F7B;&#x677E;&#x5E94;&#x5BF9;&#x5404;&#x79CD;&#x9700;&#x6C42;&#x573A;&#x666F;&#x3002;</li>
<li><strong>&#x7F13;&#x5B58;&#x5386;&#x53F2;&#x6570;&#x636E;</strong>&#xFF1A;&#x4EA4;&#x6613;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5386;&#x53F2;&#x6570;&#x636E;&#x5168;&#x90E8;&#x7F13;&#x5B58;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x540C;&#x65F6;&#x91C7;&#x7528;&#x5185;&#x5B58;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x5185;&#x5B58;&#x6570;&#x636E;&#x5207;&#x7247;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x907F;&#x514D;&#x6570;&#x636E;&#x62F7;&#x8D1D;&#xFF0C;&#x63D0;&#x9AD8;&#x8BBF;&#x95EE;&#x6548;&#x7387;&#x3002;</li>
<li><strong>&#x9AD8;&#x6548;&#x5B58;&#x50A8;&#x5F15;&#x64CE;</strong>&#xFF1A;&#x5B9E;&#x65F6;&#x6570;&#x636E;&#x91C7;&#x7528;<code>mmap</code>&#x6587;&#x4EF6;&#xFF0C;&#x8BFB;&#x5199;&#x9AD8;&#x901F;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x6570;&#x636E;&#x3002;&#x540C;&#x65F6;&#x652F;&#x6301;mysql&#x6570;&#x636E;&#x5E93;&#x5B58;&#x50A8;&#x5386;&#x53F2;&#x6570;&#x636E;&#xFF0C;&#x66F4;&#x65B9;&#x4FBF;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x642D;&#x5EFA;&#x81EA;&#x6709;&#x7684;&#x6295;&#x7814;&#x6570;&#x636E;&#x5E93;&#x3002;</li>
</ul>
</blockquote>
</li>
<li><strong>&#x7075;&#x6D3B;&#x7684;&#x98CE;&#x9669;&#x63A7;&#x5236;</strong><blockquote>
<ul>
<li><strong>&#x7EC4;&#x5408;&#x76D8;&#x8D44;&#x91D1;&#x98CE;&#x63A7;</strong>&#xFF1A;&#x7EC4;&#x5408;&#x76D8;&#x6709;&#x9884;&#x8BBE;&#x7684;&#x8D44;&#x91D1;&#x89C4;&#x6A21;&#xFF0C;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x7EC4;&#x5408;&#x76D8;&#x7684;&#x865A;&#x62DF;&#x8D44;&#x91D1;&#xFF0C;&#x8FDB;&#x884C;&#x7EC4;&#x5408;&#x76D8;&#x7684;&#x8D44;&#x91D1;&#x98CE;&#x63A7;&#x3002;&#x6700;&#x5927;&#x7684;&#x4F18;&#x70B9;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x7EC4;&#x5408;&#x76D8;&#x5904;&#x4E8E;&#x4E0B;&#x884C;&#x9636;&#x6BB5;&#xFF0C;&#x89E6;&#x53D1;&#x98CE;&#x63A7;&#x4EE5;&#x540E;&#xFF0C;&#x5373;&#x4F7F;&#x8D44;&#x91D1;&#x8D26;&#x6237;&#x6CA1;&#x6709;&#x6253;&#x5230;&#x98CE;&#x63A7;&#x7EBF;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x518D;&#x7EE7;&#x7EED;&#x4E0B;&#x884C;&#x4E86;&#x3002;</li>
<li><strong>&#x901A;&#x9053;&#x6D41;&#x91CF;&#x98CE;&#x63A7;</strong>&#xFF1A;&#x4E3B;&#x8981;&#x9488;&#x5BF9;<strong>&#x5408;&#x89C4;&#x98CE;&#x9669;</strong>&#xFF0C;&#x63A7;&#x5236;&#x7684;&#x662F;&#x603B;&#x64A4;&#x5355;&#x7B14;&#x6570;&#x3001;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x4E0B;&#x5355;&#x6B21;&#x6570;&#x548C;&#x64A4;&#x5355;&#x6B21;&#x6570;&#x7B49;&#x6307;&#x6807;&#x3002;</li>
<li><strong>&#x8D26;&#x6237;&#x8D44;&#x91D1;&#x98CE;&#x63A7;</strong>&#xFF1A;&#x548C;&#x4E00;&#x822C;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x8D44;&#x91D1;&#x98CE;&#x63A7;&#x4E00;&#x81F4;&#xFF0C;&#x4E3B;&#x8981;&#x63A7;&#x5236;&#x8D26;&#x6237;&#x8D44;&#x91D1;&#x7684;&#x56DE;&#x64A4;&#x7B49;&#x3002;</li>
<li><strong>&#x7D27;&#x6025;&#x4EBA;&#x5DE5;&#x4ECB;&#x5165;</strong>&#xFF1A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x7D27;&#x6025;&#x7684;&#x4EBA;&#x5DE5;&#x4ECB;&#x5165;&#x7684;&#x5165;&#x53E3;&#xFF0C;&#x901A;&#x8FC7;&#x4E0A;&#x4F20;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#xFF0C;&#x8FBE;&#x5230;&#x63A7;&#x5236;&#x7684;&#x76EE;&#x7684;&#x3002;&#x4E3B;&#x8981;&#x9002;&#x7528;&#x4E8E;&#x5355;&#x54C1;&#x79CD;&#x51FA;&#x73B0;&#x98CE;&#x9669;&#xFF0C;&#x5982;&#x679C;&#x5168;&#x5E02;&#x573A;&#x98CE;&#x9669;&#xFF0C;&#x4EBA;&#x5DE5;&#x505C;&#x6B62;&#x7CFB;&#x7EDF;&#x5373;&#x53EF;&#x3002;</li>
<li><strong>&#x79BB;&#x5408;&#x5668;&#x673A;&#x5236;</strong>&#xFF1A;&#x79BB;&#x5408;&#x5668;&#x673A;&#x5236;&#x4F9D;&#x6258;&#x4E8E;&#x4FE1;&#x53F7;&#x548C;&#x6267;&#x884C;&#x5206;&#x79BB;&#x7684;&#x673A;&#x5236;&#x7684;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x5982;&#x679C;&#x7B56;&#x7565;&#x6216;&#x7EC4;&#x5408;&#x53D1;&#x751F;&#x98CE;&#x9669;&#xFF0C;&#x901A;&#x8FC7;&#x79BB;&#x5408;&#x5668;&#x673A;&#x5236;&#xFF0C;&#x76F4;&#x63A5;&#x65AD;&#x5F00;&#x4FE1;&#x53F7;&#x6267;&#x884C;&#x3002;&#x4F18;&#x70B9;&#x662F;&#x4E0D;&#x5F71;&#x54CD;&#x7B56;&#x7565;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x53EA;&#x65AD;&#x5F00;&#x4FE1;&#x53F7;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x89C2;&#x5BDF;&#x7B56;&#x7565;&#x5728;&#x7279;&#x5B9A;&#x884C;&#x60C5;&#x9636;&#x6BB5;&#x7684;&#x8868;&#x73B0;&#xFF0C;&#x548C;&#x7406;&#x8BBA;&#x7814;&#x7A76;&#x76F8;&#x4E92;&#x5370;&#x8BC1;&#x3002;</li>
</ul>
</blockquote>
</li>
<li><strong>&#x5F3A;&#x5927;&#x7684;&#x63A7;&#x5236;&#x53F0;</strong>&#xFF08;<a href="https://github.com/wondertrader/wtpy" target="_blank">wtpy</a>&#x7684;&#x76D1;&#x63A7;&#x670D;&#x52A1;&#xFF09;<blockquote>
<ul>
<li><strong>&#x7EC4;&#x5408;&#x76D8;&#x8FD0;&#x884C;&#x76D1;&#x63A7;</strong>&#xFF1A;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x5B9E;&#x65F6;&#x8FD0;&#x884C;&#x65E5;&#x5FD7;&#x3001;&#x7B56;&#x7565;&#x7406;&#x8BBA;&#x6570;&#x636E;&#x3001;&#x4EA4;&#x6613;&#x901A;&#x9053;&#x6570;&#x636E;&#x7B49;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x624B;&#x52A8;&#x542F;&#x505C;&#x7684;&#x5165;&#x53E3;&#x3002;
<img src="http://wt.f-sailors.cn/snapshots/monitor.jpg" alt="monitor.jpg"></li>
<li><strong>&#x81EA;&#x52A8;&#x8C03;&#x5EA6;&#x670D;&#x52A1;</strong>&#xFF1A;&#x5168;&#x81EA;&#x52A8;&#x8C03;&#x5EA6;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#xFF08;&#x542F;&#x52A8;&#x3001;&#x505C;&#x6B62;&#x3001;&#x91CD;&#x542F;&#xFF09;&#xFF0C;&#x652F;&#x6301;&#x6309;&#x5468;&#x8BBE;&#x7F6E;&#x4EFB;&#x52A1;&#x91CD;&#x590D;&#xFF0C;&#x652F;&#x6301;&#x8FDB;&#x7A0B;&#x5B88;&#x62A4;&#x3002;
<img src="http://wt.f-sailors.cn/snapshots/schedule.jpg" alt="schedule.jpg"></li>
<li><strong>&#x5B9E;&#x65F6;&#x4E8B;&#x4EF6;&#x901A;&#x77E5;</strong>&#xFF1A;&#x76D1;&#x63A7;&#x670D;&#x52A1;&#x63A5;&#x6536;&#x7EC4;&#x5408;&#x76D8;&#x63A8;&#x9001;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x8F6C;&#x53D1;&#x7ED9;&#x76D1;&#x63A7;&#x7AEF;&#xFF0C;&#x63D0;&#x793A;&#x7ED9;&#x7528;&#x6237;&#x3002;</li>
<li><strong>&#x5168;&#x81EA;&#x52A8;&#x8FDC;&#x7A0B;&#x90E8;&#x7F72;(&#x5728;&#x5EFA;)</strong>&#xFF1A;&#x5168;&#x81EA;&#x52A8;&#x5728;&#x7EBF;&#x8FDC;&#x7A0B;&#x90E8;&#x7F72;&#xFF0C;&#x63D0;&#x4F9B;&#x56DE;&#x6D4B;&#x73AF;&#x5883;&#x3001;&#x5B9E;&#x76D8;&#x73AF;&#x5883;&#x7B49;&#x591A;&#x79CD;&#x5E94;&#x7528;&#x573A;&#x666F;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x90E8;&#x7F72;&#x670D;&#x52A1;&#x3002;</li>
<li><strong>&#x5728;&#x7EBF;&#x56DE;&#x6D4B;&#x5206;&#x6790;(&#x5728;&#x5EFA;)</strong>&#xFF1A;&#x5168;&#x81EA;&#x52A8;&#x8FDC;&#x7A0B;&#x90E8;&#x7F72;&#x4EE5;&#x540E;&#xFF0C;&#x63D0;&#x4F9B;&#x5728;&#x7EBF;&#x56DE;&#x6D4B;&#x670D;&#x52A1;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x7ED3;&#x679C;&#x5206;&#x6790;&#x548C;&#x56FE;&#x5F62;&#x5316;&#x5C55;&#x793A;&#x3002;</li>
</ul>
</blockquote>
</li>
</ul>
<h4 id="&#x5E94;&#x7528;&#x573A;&#x666F;&#x7B80;&#x4ECB;">&#x5E94;&#x7528;&#x573A;&#x666F;&#x7B80;&#x4ECB;</h4>
<ul>
<li><strong>&#x56E2;&#x961F;&#x5185;&#x63A7;</strong>
  &#x7B56;&#x7565;&#x7EC4;&#x5408;&#x7BA1;&#x7406;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x7ED9;&#x56E2;&#x961F;&#x5185;&#x90E8;&#x7BA1;&#x7406;&#x63D0;&#x4F9B;&#x4E86;&#x5B8C;&#x7F8E;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;<ul>
<li>&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x4E0D;&#x540C;&#x6295;&#x7814;&#x4EBA;&#x5458;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x7B56;&#x7565;&#x53EF;&#x4EE5;&#x7EC4;&#x5408;&#x6210;&#x4E00;&#x4E2A;&#x7EC4;&#x5408;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x4E14;&#x6BCF;&#x4E2A;&#x7B56;&#x7565;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x8BBA;&#x90E8;&#x4F4D;&#xFF0C;&#x5373;&#x4F7F;&#x4EA4;&#x6613;&#x76F8;&#x540C;&#x6807;&#x7684;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E92;&#x76F8;&#x5E72;&#x6270;&#xFF1B;</li>
<li>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;C++&#x7EA7;&#x522B;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6700;&#x5927;&#x7684;&#x7B56;&#x7565;&#x4FDD;&#x5BC6;&#x6027;&#xFF0C;&#x6295;&#x7814;&#x4EBA;&#x5458;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x7B56;&#x7565;&#x7684;&#x6CC4;&#x9732;&#xFF1B;</li>
<li>&#x7B56;&#x7565;&#x7684;&#x7EE9;&#x6548;&#x662F;&#x72EC;&#x7ACB;&#x6838;&#x7B97;&#x7684;&#xFF0C;&#x56E2;&#x961F;&#x5185;&#x90E8;&#x7684;&#x8003;&#x6838;&#x6307;&#x6807;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x3002;</li>
</ul>
</li>
<li><strong>&#x591A;&#x8D26;&#x6237;&#x4EA4;&#x6613;</strong>&#xFF08;<strong>&#x591A;&#x4EA7;&#x54C1;&#x914D;&#x7F6E;</strong>&#xFF09;
  &#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x884C;&#x60C5;&#x5468;&#x671F;&#x4E0B;&#x7684;&#x7B56;&#x7565;&#x7EC4;&#x5408;&#xFF0C;&#x4E00;&#x822C;&#x56E2;&#x961F;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x5F53;&#x4E0B;&#x6700;&#x9002;&#x5E94;&#x7684;&#x7B56;&#x7565;&#x7EC4;&#x5408;&#x3002;&#x4F46;&#x662F;&#x540C;&#x4E00;&#x65F6;&#x671F;&#xFF0C;&#x56E2;&#x961F;&#x53EF;&#x80FD;&#x4F1A;&#x540C;&#x65F6;&#x7BA1;&#x7406;&#x5F88;&#x591A;&#x4E2A;&#x8D26;&#x6237;&#xFF0C;&#x800C;&#x5176;&#x5B9E;&#x8FD9;&#x4E9B;&#x8D26;&#x6237;&#x7528;&#x5230;&#x7684;&#x7B56;&#x7565;&#x7EC4;&#x5408;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;<code>WonderTrader</code>&#x5E73;&#x53F0;&#x63D0;&#x4F9B;&#x7684;<strong>1+N&#x6267;&#x884C;&#x67B6;&#x6784;</strong>&#x5C31;&#x80FD;&#x591F;&#x5B8C;&#x7F8E;&#x7684;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E2A;&#x9700;&#x6C42;&#x3002;<ul>
<li>&#x9996;&#x5148;&#xFF0C;&#x7B56;&#x7565;&#x7EC4;&#x5408;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5355;&#x4F4D;&#x8D44;&#x91D1;&#x5BB9;&#x91CF;&#x548C;&#x5BF9;&#x5E94;&#x7684;&#x98CE;&#x9669;&#x53C2;&#x6570;&#xFF0C;&#x4EE5;&#x53CA;&#x5404;&#x4E2A;&#x7B56;&#x7565;&#x7684;&#x5355;&#x4F4D;&#x4EA4;&#x6613;&#x6570;&#x91CF;&#xFF1B;</li>
<li>&#x5176;&#x6B21;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x8D26;&#x6237;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8D44;&#x91D1;&#x89C4;&#x6A21;&#x548C;&#x98CE;&#x9669;&#x504F;&#x597D;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x53EA;&#x9700;&#x8981;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x8981;&#x6C42;&#x914D;&#x7F6E;&#x4E0D;&#x540C;&#x7684;&#x624B;&#x6570;&#x500D;&#x7387;&#x5373;&#x53EF;&#xFF1B;<blockquote>
<p>&#x5047;&#x5982;&#x67D0;&#x7EC4;&#x5408;&#x76D8;P&#x57FA;&#x672C;&#x8D44;&#x91D1;&#x89C4;&#x6A21;&#x4E3A;500w&#xFF0C;&#x9884;&#x671F;&#x6536;&#x76CA;30%&#xFF0C;&#x6700;&#x5927;&#x56DE;&#x64A4;10%&#xFF0C;&#x6536;&#x76CA;&#x98CE;&#x9669;&#x6BD4;3:1&#xFF1B;A&#x8D26;&#x6237;&#x4F7F;&#x7528;&#x8BE5;&#x7EC4;&#x5408;&#x76D8;P&#x4EA4;&#x6613;&#xFF0C;A&#x8D26;&#x6237;&#x7684;&#x8D44;&#x91D1;&#x91CF;&#x4E3A;1000w&#xFF0C;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#x6700;&#x5927;&#x56DE;&#x64A4;&#x4E5F;&#x662F;10%&#xFF1B;B&#x8D26;&#x6237;&#x4E5F;&#x4F7F;&#x7528;&#x8BE5;&#x7EC4;&#x5408;&#x76D8;P&#x4EA4;&#x6613;&#xFF0C;&#x8D44;&#x91D1;&#x91CF;&#x4E5F;&#x662F;1000w&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#x6700;&#x5927;&#x56DE;&#x64A4;&#x4E3A;20%&#xFF1B;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x56E0;&#x4E3A;A&#x8D26;&#x6237;&#x98CE;&#x9669;&#x53C2;&#x6570;&#x548C;&#x57FA;&#x672C;&#x76D8;&#x4E00;&#x81F4;&#xFF0C;&#x6240;&#x4EE5;A&#x8D26;&#x6237;&#x7684;&#x624B;&#x6570;&#x653E;&#x5927;&#x500D;&#x6570;&#x4E3A;&#x8D44;&#x91D1;&#x89C4;&#x6A21;/&#x57FA;&#x672C;&#x76D8;&#x7684;&#x8D44;&#x91D1;&#x89C4;&#x6A21;=1000w/500w=2&#x500D;&#xFF1B;B&#x8D26;&#x6237;&#x56E0;&#x4E3A;&#x53EF;&#x4EE5;&#x5FCD;&#x53D7;&#x6700;&#x5927;&#x56DE;&#x64A4;20%&#xFF0C;&#x6240;&#x4EE5;&#x624B;&#x6570;&#x6BD4;&#x4F8B;&#x8FD8;&#x8981;&#x518D;&#x653E;&#x5927;&#x4E00;&#x500D;&#xFF0C;&#x5373;B&#x8D26;&#x6237;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;4&#x500D;&#x3002;</p>
</blockquote>
</li>
<li>&#x7B2C;&#x4E09;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x8D26;&#x6237;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x72EC;&#x7ACB;&#x7684;&#x98CE;&#x63A7;&#x903B;&#x8F91;&#xFF0C;&#x8D26;&#x6237;&#x4E4B;&#x95F4;&#x4E0D;&#x4F1A;&#x4E92;&#x76F8;&#x5F71;&#x54CD;&#x3002;</li>
</ul>
</li>
<li><strong>&#x591A;&#x6807;&#x7684;&#x8DDF;&#x8E2A;</strong>
  &#x4E00;&#x4E9B;&#x7528;&#x89E3;&#x91CA;&#x578B;&#x8BED;&#x8A00;&#xFF08;&#x5982;<code>Python</code>&#xFF09;&#x5F00;&#x53D1;&#x6838;&#x5FC3;&#x6A21;&#x5757;&#x7684;&#x91CF;&#x5316;&#x4EA4;&#x6613;&#x5E73;&#x53F0;&#xFF0C;&#x5728;&#x6807;&#x7684;&#x6570;&#x4E0D;&#x591A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x80FD;&#x591F;&#x80DC;&#x4EFB;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x9700;&#x8981;&#x8DDF;&#x8E2A;&#x7684;&#x6807;&#x7684;&#x6570;&#x8FBE;&#x5230;100&#x4E2A;&#x4EE5;&#x4E0A;&#xFF0C;&#x751A;&#x81F3;&#x662F;50&#x4E2A;&#x4EE5;&#x4E0A;&#x65F6;&#xFF0C;&#x5C31;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x9700;&#x6C42;&#x4E86;&#x3002;&#x4E00;&#x65B9;&#x9762;&#x8D44;&#x6E90;&#x5360;&#x7528;&#x5927;&#xFF0C;&#x5229;&#x7528;multiprocess&#x7B49;&#x673A;&#x5236;&#xFF0C;&#x867D;&#x7136;&#x5404;&#x4E2A;&#x6807;&#x7684;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x4E0A;&#x767E;&#x4E2A;&#x6807;&#x7684;&#x5C31;&#x8981;&#x65B0;&#x5EFA;&#x4E0A;&#x767E;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x5185;&#x5B58;&#x548C;CPU&#x5F00;&#x9500;&#x90FD;&#x975E;&#x5E38;&#x5927;&#xFF1B;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x7B56;&#x7565;&#x6548;&#x7387;&#x4F4E;&#xFF0C;&#x8D44;&#x6E90;&#x4E89;&#x5F3A;&#x4E25;&#x91CD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7B56;&#x7565;&#x53CD;&#x5E94;&#x4E5F;&#x4F1A;&#x53D8;&#x6162;&#x3002;
  WonderTrader&#x6838;&#x5FC3;&#x91C7;&#x7528;C++&#x5F00;&#x53D1;&#xFF0C;&#x6570;&#x636E;&#x4F3A;&#x670D;&#x66F4;&#x662F;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x8BBE;&#x8BA1;&#x6210;&#x5411;&#x591A;&#x4E2A;&#x7EC4;&#x5408;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x540C;&#x65F6;&#x7B56;&#x7565;&#x548C;&#x6267;&#x884C;&#x5265;&#x79BB;&#xFF0C;&#x4FE1;&#x53F7;&#x6267;&#x884C;&#x548C;&#x7B56;&#x7565;&#x8BA1;&#x7B97;&#x5B8C;&#x5168;&#x5728;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x3002;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x67B6;&#x6784;&#x4E0B;&#xFF0C;&#x5C31;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x7684;&#x6EE1;&#x8DB3;&#x591A;&#x6807;&#x7684;&#x8DDF;&#x8E2A;&#x7684;&#x9700;&#x6C42;&#x3002;</li>
<li><strong>&#x5927;&#x8BA1;&#x7B97;&#x91CF;&#x7B56;&#x7565;</strong>
  &#x4E00;&#x4E9B;&#x7B56;&#x7565;&#x8BA1;&#x7B97;&#x91CF;&#x4F1A;&#x975E;&#x5E38;&#x60CA;&#x4EBA;&#xFF0C;&#x6BD4;&#x8F83;&#x5178;&#x578B;&#x7684;&#x5C31;&#x662F;&#x9009;&#x80A1;&#x7B56;&#x7565;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x7528;&#x591A;&#x56E0;&#x5B50;&#x4E5F;&#x597D;&#xFF0C;&#x8FD8;&#x662F;&#x57FA;&#x672C;&#x9762;&#x4E5F;&#x597D;&#xFF0C;&#x90FD;&#x4F1A;&#x4ECE;&#x6570;&#x5343;&#x53EA;&#x80A1;&#x7968;&#x4E2D;&#xFF0C;&#x9010;&#x6B65;&#x7B5B;&#x9009;&#xFF0C;&#x4ECE;&#x800C;&#x5F97;&#x5230;&#x6700;&#x540E;&#x7684;&#x76EE;&#x6807;&#x80A1;&#x6C60;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x4E00;&#x4E9B;&#x591A;&#x6807;&#x7684;&#x7684;&#x591A;&#x56E0;&#x5B50;&#x6846;&#x67B6;&#x4E5F;&#x5177;&#x6709;&#x8F83;&#x5927;&#x7684;&#x8BA1;&#x7B97;&#x91CF;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x8BA1;&#x7B97;&#x91CF;&#x975E;&#x5E38;&#x5E9E;&#x5927;&#xFF0C;&#x8017;&#x65F6;&#x4E5F;&#x957F;&#x3002;
  <code>WonderTrader</code>&#x7684;SEL&#x5F15;&#x64CE;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x6EE1;&#x8DB3;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x9700;&#x6C42;&#x800C;&#x5B9A;&#x5236;&#x7684;&#x3002;SEL&#x5F15;&#x64CE;&#x91C7;&#x7528;&#x5F02;&#x6B65;&#x65F6;&#x95F4;&#x9A71;&#x52A8;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x901A;&#x8FC7;&#x5411;&#x5F15;&#x64CE;&#x6CE8;&#x518C;&#x91CD;&#x7B97;&#x65F6;&#x95F4;&#x8C03;&#x5EA6;&#xFF08;&#x652F;&#x6301;&#x65E5;&#x5185;&#xFF0C;&#x6BCF;&#x65E5;&#x3001;&#x6BCF;&#x5468;&#x3001;&#x6BCF;&#x6708;&#x7684;&#x7B49;&#x591A;&#x79CD;&#x5468;&#x671F;&#xFF09;&#xFF0C;&#x5B9A;&#x65F6;&#x89E6;&#x53D1;&#x91CD;&#x7B97;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x6574;&#x591A;&#x6807;&#x7684;&#x7684;&#x76EE;&#x6807;&#x4ED3;&#x4F4D;&#xFF0C;&#x4ECE;&#x800C;&#x8F93;&#x51FA;&#x4FE1;&#x53F7;&#x3002;</li>
</ul>
<h4 id="wtpy&#x7B80;&#x4ECB;"><code>wtpy</code>&#x7B80;&#x4ECB;</h4>
<ul>
<li><code>wtpy</code>&#x662F;&#x6784;&#x5EFA;&#x5728;<code>WonderTrader</code>&#x6838;&#x5FC3;&#x6A21;&#x5757;&#x4E4B;&#x4E0A;&#x7684;&#xFF0C;&#x4F7F;&#x7528;<code>Python3</code>&#x5F00;&#x53D1;&#x7684;<code>WonderTrader</code>&#x7684;<code>Python3</code>&#x5B50;&#x6846;&#x67B6;</li>
<li><code>Python</code>&#x4F5C;&#x4E3A;&#x91CF;&#x5316;&#x9886;&#x57DF;&#x6700;&#x6D41;&#x884C;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5728;&#x65F6;&#x5E8F;&#x6570;&#x636E;&#x5904;&#x7406;&#x4E0A;&#x6709;&#x8BB8;&#x591A;&#x975E;&#x5E38;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x5F3A;&#x5927;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x5E93;</li>
<li><code>Python</code>&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x89E3;&#x91CA;&#x578B;&#x8BED;&#x8A00;&#xFF0C;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x548C;&#x8C03;&#x8BD5;&#x90FD;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x7F16;&#x8BD1;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8FD0;&#x884C;</li>
<li><code>Python</code>&#x7684;&#x8DE8;&#x5E73;&#x53F0;&#x5C5E;&#x6027;&#x4E5F;&#x4F7F;<code>Python</code>&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x5230;&#x66F4;&#x591A;&#x7684;&#x573A;&#x666F;&#x4E2D;</li>
<li><code>wtpy</code>&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x662F;&#x4F5C;&#x4E3A;<code>WonderTrader</code>&#x5728;<code>Python</code>&#x8BED;&#x8A00;&#x7684;&#x5916;&#x5EF6;</li>
<li>&#x540C;&#x65F6;<code>wtpy</code>&#x8FD8;&#x5185;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x5F3A;&#x5927;&#x7684;&#x76D1;&#x63A7;&#x670D;&#x52A1;&#x7EC4;&#x4EF6;<code>WtMonSvr</code>&#x3002;&#x8BE5;&#x7EC4;&#x4EF6;&#x63D0;&#x4F9B;&#x4E86;&#x8FDC;&#x7A0B;&#x7684;<code>webui</code>&#x7684;&#x76D1;&#x63A7;&#x754C;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x65F6;&#x76D1;&#x63A7;&#x7B56;&#x7565;&#x7EC4;&#x5408;&#x7684;&#x8FD0;&#x884C;&#x60C5;&#x51B5;&#xFF0C;&#x8FD8;&#x63D0;&#x4F9B;&#x5168;&#x5929;<code>24&#xD7;7</code>&#x7684;&#x81EA;&#x52A8;&#x8C03;&#x5EA6;&#x670D;&#x52A1;&#xFF0C;&#x4E3A;&#x4F60;&#x7684;&#x4EA4;&#x6613;&#x4FDD;&#x9A7E;&#x62A4;&#x822A;&#x3002;</li>
</ul>
<h4 id="wondertrader&#x600E;&#x4E48;&#x83B7;&#x53D6;"><code>WonderTrader</code>&#x600E;&#x4E48;&#x83B7;&#x53D6;</h4>
<ul>
<li><code>WonderTrader</code>&#x7684;<code>github</code>&#x5730;&#x5740;&#xFF1A;<a href="https://github.com/wondertrader/wondertrader" target="_blank">https://github.com/wondertrader/wondertrader</a></li>
<li><p><code>wtpy</code>&#x7684;<code>github</code>&#x5730;&#x5740;&#xFF1A;<a href="https://github.com/wondertrader/wtpy" target="_blank">https://github.com/wondertrader/wtpy</a></p>
</li>
<li><p><code>wtpy</code>&#x83B7;&#x53D6;&#x5730;&#x5740;&#xFF1A;<a href="https://pypi.org/project/wtpy/" target="_blank">https://pypi.org/project/wtpy/</a>
  <code>wtpy</code>&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5728;<code>python3.5</code>&#x4EE5;&#x4E0A;&#x7684;&#x7248;&#x672C;&#x5B89;&#x88C5;</p>
<pre><code class="lang-shell">  pip install wtpy
</code></pre>
</li>
</ul>
<h4 id="&#x7279;&#x522B;&#x611F;&#x8C22;">&#x7279;&#x522B;&#x611F;&#x8C22;</h4>
<ul>
<li><code>WonderTrader</code>&#x5F00;&#x6E90;&#x4EE5;&#x540E;&#xFF0C;&#x867D;&#x7136;&#x6CA1;&#x6709;&#x4E13;&#x95E8;&#x8FDB;&#x884C;&#x8FC7;&#x63A8;&#x5E7F;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5438;&#x5F15;&#x4E86;&#x4E00;&#x4E9B;&#x613F;&#x610F;&#x7B2C;&#x4E00;&#x6279;&#x5403;&#x8783;&#x87F9;&#x7684;&#x7528;&#x6237;&#x3002;<code>WonderTrader</code>&#x8FD8;&#x4E0D;&#x591F;&#x6210;&#x719F;&#x7684;&#x5F53;&#x4E0B;&#xFF0C;&#x8FD8;&#x80FD;&#x591F;&#x5F97;&#x5230;&#x8FD9;&#x4E9B;&#x7528;&#x6237;&#x7684;&#x8BA4;&#x53EF;&#xFF0C;&#x8FD9;&#x662F;<code>WonderTrader</code>&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x7684;&#x8363;&#x5E78;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x8981;&#x7279;&#x522B;&#x611F;&#x8C22;@sibaba8888&#xFF0C;&#x4ED6;&#x63D0;&#x51FA;&#x4E86;&#x4E0D;&#x5C11;&#x5B9D;&#x8D35;&#x7684;&#x6539;&#x8FDB;&#x610F;&#x89C1;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8981;&#x611F;&#x8C22;@sunphoenix&#xFF0C;&#x4ED6;&#x7ED9;&#x6211;&#x4EEC;&#x4E5F;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x6709;&#x7528;&#x7684;&#x4FE1;&#x606F;&#x3002;</li>
</ul>
<h4 id="&#x5199;&#x5728;&#x6700;&#x540E;">&#x5199;&#x5728;&#x6700;&#x540E;</h4>
<hr>
<ul>
<li>&#x5173;&#x6CE8;&#x516C;&#x4F17;&#x53F7;<code>wondertrader</code>&#xFF0C;&#x53EF;&#x4EE5;&#x6536;&#x5230;<code>WonderTrader</code>&#x7684;&#x5B9E;&#x65F6;&#x8D44;&#x8BAF;</li>
<li>&#x7528;&#x6237;&#x4EA4;&#x6D41;QQ&#x7FA4;&#x4E0A;&#x7EBF;&#xFF1A;<code>610730738</code>(&#x52A0;&#x5165;&#x524D;&#x8BF7;&#x5148;<code>star</code>&#x4E00;&#x4E0B;, &#x7136;&#x540E;&#x63D0;&#x4F9B;<code>github</code>&#x7528;&#x6237;&#x540D;)</li>
</ul>

                                
                                </section>
                            
                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"WonderTrader简介","level":"1.1","depth":1,"next":{"title":"基本用法","level":"1.2","depth":1,"ref":"","articles":[{"title":"快速入门","level":"1.2.1","depth":2,"path":"tutorial.md","ref":"tutorial.md","articles":[]},{"title":"如何编译和安装","level":"1.2.2","depth":2,"path":"install.md","ref":"install.md","articles":[]},{"title":"历史数据的处理","level":"1.2.3","depth":2,"path":"histdata.md","ref":"histdata.md","articles":[]},{"title":"回测自己的策略","level":"1.2.4","depth":2,"path":"mystrategy.md","ref":"mystrategy.md","articles":[]},{"title":"实盘完整攻略","level":"1.2.5","depth":2,"path":"product.md","ref":"product.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["-search","github","github-buttons","livereload"],"styles":{"website":"./styles/website.css"},"pluginsConfig":{"github":{"url":"https://github.com/wondertrader/wondertrader"},"github-buttons":{"buttons":[{"user":"wondertrader","repo":"wondertrader","type":"star","size":"small","count":true}]},"livereload":{},"highlight":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"WonderTrader","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"WonderTrader-组合盘管理的利器","language":"zh-hans","links":{"sidebar":{"官网":"https://wondertrader.github.io"}},"gitbook":"3.2.3","description":"Documents of WonderTrader"},"file":{"path":"README.md","mtime":"2020-09-25T03:32:46.939Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-09-25T06:55:12.345Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/buttons.js"></script>
        
    

    </body>
</html>

