
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>WonderTrader简介 · WonderTrader-组合盘管理的利器</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="WonderTrader">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    

    <style>
    @media only screen and (max-width: 640px) {
        .book-header .hidden-mobile {
            display: none;
        }
    }
    </style>
    <script>
        window["gitbook-plugin-github-buttons"] = {"buttons":[{"user":"wondertrader","repo":"wondertrader","type":"star","size":"small","count":true}]};
    </script>

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://wondertrader.github.io" target="_blank" class="custom-link">官网</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    WonderTrader简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    基本用法
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="tutorial.html">
            
                <a href="tutorial.html">
            
                    
                    快速入门
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="install.html">
            
                <a href="install.html">
            
                    
                    如何编译和安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="histdata.html">
            
                <a href="histdata.html">
            
                    
                    历史数据的处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="mystrategy.html">
            
                <a href="mystrategy.html">
            
                    
                    回测自己的策略
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="product.html">
            
                <a href="product.html">
            
                    
                    实盘完整攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" >
            
                <span>
            
                    
                    Python API详解
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="structure.html">
            
                <a href="structure.html">
            
                    
                    策略模块详解
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="interfaces.html">
            
                <a href="interfaces.html">
            
                    
                    接口文档
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" >
            
                <span>
            
                    
                    使用进阶
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="datakit.html">
            
                <a href="datakit.html">
            
                    
                    数据组件简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="execunit.html">
            
                <a href="execunit.html">
            
                    
                    编写自己的执行单元
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="riskmon.html">
            
                <a href="riskmon.html">
            
                    
                    编写自己的风控模块
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="moreexchg.html">
            
                <a href="moreexchg.html">
            
                    
                    对接其他交易市场
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="morelan.html">
            
                <a href="morelan.html">
            
                    
                    对接其他语言
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="divider"></li>
        
        
    
        <li class="chapter " data-level="2.1" >
            
                <a target="_blank" href="mailto:wondertrader@126.com">
            
                    
                    wondertrader@126.com
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" >
            
                <a target="_blank" href="https://github.com/wondertrader/wondertrader/">
            
                    
                    Github地址
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >WonderTrader简介</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
                                <section class="normal markdown-section">
                                
                                <p><img src="http://q92ex9g0c.bkt.clouddn.com/wt/logo_qcode_ad.jpg" alt="WonderTrader2.png"></p>
<h4 id="what---&#x4EC0;&#x4E48;&#x662F;wondertrader"><em>What</em> - &#x4EC0;&#x4E48;&#x662F;<em>WonderTrader</em></h4>
<hr>
<ul>
<li><p><em>WonderTrader</em>&#x8981;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;
  <em>WonderTrader</em>&#x662F;&#x4E00;&#x4E2A;&#x9488;&#x5BF9;CTA&#x7EC4;&#x5408;&#x76D8;&#x7BA1;&#x7406;&#x7684;&#x5F00;&#x6E90;&#x91CF;&#x5316;&#x4EA4;&#x6613;&#x6846;&#x67B6;&#xFF0C;&#x662F;<strong>&#x7EC4;&#x5408;&#x76D8;&#x7BA1;&#x7406;&#x7684;&#x5229;&#x5668;</strong>&#xFF01;
  <em>WonderTrader</em>&#x65E8;&#x5728;&#x63D0;&#x4F9B;&#x4E00;&#x5957;&#x76F8;&#x5BF9;&#x901A;&#x7528;&#x7684;&#x6280;&#x672F;&#x6846;&#x67B6;&#xFF0C;&#x89E3;&#x8026;&#x91CF;&#x5316;&#x4EA4;&#x6613;&#x6280;&#x672F;&#x6846;&#x67B6;&#x4E2D;&#x7684;&#x7B56;&#x7565;&#x548C;&#x6280;&#x672F;&#xFF0C;&#x4ECE;&#x800C;&#x8BA9;&#x7B56;&#x7565;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x4E13;&#x6CE8;&#x7B56;&#x7565;&#x672C;&#x8EAB;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x8BA9;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E13;&#x6CE8;&#x6280;&#x672F;&#x6846;&#x67B6;&#x7684;&#x6027;&#x80FD;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x5F00;&#x653E;&#x7684;&#x3001;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#x3001;&#x9AD8;&#x5EA6;&#x53EF;&#x5B9A;&#x5236;&#x7684;&#x91CF;&#x5316;&#x7B56;&#x7565;&#x6280;&#x672F;&#x6846;&#x67B6;&#x3002;</p>
</li>
<li><p><em>WonderTrader</em>&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x8DEF;
  &#x4ECE;&#x5468;&#x8FB9;&#x6765;&#x8BF4;&#xFF0C;<em>WonderTrader</em>&#x672C;&#x7740;<strong>&#x4E13;&#x4E1A;&#x7684;&#x4EBA;&#x505A;&#x4E13;&#x4E1A;&#x7684;&#x4E8B;</strong>&#x7684;&#x57FA;&#x672C;&#x539F;&#x5219;&#xFF0C;&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x8003;&#x8651;&#x5230;&#x5F88;&#x591A;&#x7B56;&#x7565;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x7F16;&#x7A0B;&#x6C34;&#x5E73;&#x6709;&#x9650;&#x7684;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#xFF0C;&#x800C;&#x91C7;&#x7528;C++&#x4F5C;&#x4E3A;&#x5E95;&#x5C42;&#x6838;&#x5FC3;&#x6846;&#x67B6;&#xFF0C;&#x7136;&#x540E;&#x7528;C&#x63A5;&#x53E3;&#x5BFC;&#x51FA;&#xFF0C;&#x4ECE;&#x800C;&#x7ED9;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x8C03;&#x7528;&#x63D0;&#x4F9B;&#x4E86;&#x4FBF;&#x5229;&#x3002;
  &#x4ECE;&#x6838;&#x5FC3;&#x6765;&#x8BF4;&#xFF0C;&#x8981;&#x8FBE;&#x5230;&#x5F00;&#x653E;&#x3001;&#x9AD8;&#x53EF;&#x7528;&#x3001;&#x9AD8;&#x5EA6;&#x53EF;&#x5B9A;&#x5236;&#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#xFF0C;&#x6838;&#x5FC3;&#x7684;&#x8BBE;&#x8BA1;&#x9075;&#x5FAA;<strong>&#x6838;&#x5FC3;&#x903B;&#x8F91;+&#x529F;&#x80FD;&#x6A21;&#x5757;</strong>&#x7684;&#x539F;&#x5219;&#x8FDB;&#x884C;&#x89E3;&#x8026;&#xFF0C;&#x5C06;&#x5404;&#x4E2A;&#x76F4;&#x63A5;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x5168;&#x90E8;&#x653E;&#x5230;&#x5916;&#x90E8;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x8FD9;&#x6837;&#x7B56;&#x7565;&#x5F00;&#x53D1;&#x8005;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x5FC3;&#x4FE1;&#x53F7;&#x7684;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x5404;&#x4E2A;&#x529F;&#x80FD;&#x5F00;&#x53D1;&#x8005;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x8DDF;&#x7B56;&#x7565;&#x4EA4;&#x4E92;&#x7684;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x4E3A;&#x4EA4;&#x4E92;&#x7684;&#x903B;&#x8F91;&#x90FD;&#x653E;&#x5230;&#x4E86;&#x6838;&#x5FC3;&#x91CC;&#x3002;  </p>
</li>
<li><p><em>WonderTrader</em>&#x7684;&#x57FA;&#x672C;&#x67B6;&#x6784;&#x56FE;
  <img src="https://image-static.segmentfault.com/406/400/4064005384-5e969b98d0161_articlex" alt="WonderTrader&#x57FA;&#x672C;&#x67B6;&#x6784;.jpg"></p>
</li>
</ul>
<h4 id="why---&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7528;wondertrader"><em>Why</em> - &#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7528;<em>WonderTrader</em></h4>
<hr>
<ul>
<li><p>&#x7B56;&#x7565;&#x4E00;&#x6B21;&#x6027;&#x7F16;&#x5199;&#xFF0C;&#x65B9;&#x4FBF;&#x53C8;&#x4E0D;&#x6613;&#x51FA;&#x9519;
  &#x65E0;&#x8BBA;&#x662F;&#x7528;<em>C++</em>&#x5F00;&#x53D1;&#x7B56;&#x7565;&#x5728;&#x5E95;&#x5C42;&#x6846;&#x67B6;&#x4E0A;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#xFF0C;&#x8FD8;&#x662F;&#x5728;<em>Python</em>&#x5B50;&#x6846;&#x67B6;&#x4E0B;&#x5F00;&#x53D1;&#x7B56;&#x7565;&#xFF0C;&#x90FD;&#x80FD;&#x505A;&#x5230;&#x56DE;&#x6D4B;&#x548C;&#x5B9E;&#x76D8;&#x65E0;&#x4FEE;&#x6539;&#x76F4;&#x63A5;&#x8FC1;&#x79FB;&#x3002;&#x65E2;&#x65B9;&#x4FBF;&#x5F00;&#x53D1;&#x548C;&#x8FC1;&#x79FB;&#xFF0C;&#x53C8;&#x4E0D;&#x4F1A;&#x56E0;&#x4E3A;&#x8981;&#x6539;&#x5199;&#x4EE3;&#x7801;&#x800C;&#x7ED9;&#x5DF2;&#x7ECF;&#x6D4B;&#x8BD5;&#x597D;&#x7684;&#x7B56;&#x7565;&#x5F15;&#x5165;&#x65B0;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
</li>
<li><p>&#x7B56;&#x7565;&#x53EF;&#x4EE5;&#x5728;C++&#x5E95;&#x5C42;&#x4E0A;&#x76F4;&#x63A5;&#x5F00;&#x53D1;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x5B50;&#x6846;&#x67B6;&#x4E0B;&#x7F16;&#x5199;&#xFF0C;&#x6EE1;&#x8DB3;&#x4E0D;&#x540C;&#x7684;&#x573A;&#x666F;&#x9700;&#x8981;
  &#x7528;&#x6237;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x9009;&#x62E9;&#x5728;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x5B50;&#x6846;&#x67B6;&#x4E0B;&#x5F00;&#x53D1;&#x7B56;&#x7565;&#xFF08;&#x76EE;&#x524D;&#x662F;<em>python3</em>&#xFF09;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x7528;<em>C++</em>&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#xFF0C;<em>WonderTrader</em>&#x90FD;&#x63D0;&#x4F9B;&#x5B8C;&#x5907;&#x7684;&#x63A5;&#x53E3;&#xFF08;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x7528;&#x6237;&#xFF0C;<em>python</em>&#x5B50;&#x6846;&#x67B6;<em>wtpy</em>&#x548C;<em>C++</em>&#x7684;&#x7B56;&#x7565;&#x8C03;&#x7528;&#x7684;&#x63A5;&#x53E3;&#x547D;&#x540D;&#x90FD;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF09;</p>
</li>
<li><p>&#x7B56;&#x7565;&#x7684;&#x903B;&#x8F91;&#x548C;&#x6267;&#x884C;&#x5F7B;&#x5E95;&#x5206;&#x79BB;&#xFF0C;&#x8BA9;<strong>&#x4E13;&#x4E1A;&#x7684;&#x4EBA;&#x505A;&#x4E13;&#x4E1A;&#x7684;&#x4E8B;</strong>&#x3002;
  &#x7B56;&#x7565;&#x7814;&#x53D1;&#x4EBA;&#x5458;&#x53EA;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x7B56;&#x7565;&#x672C;&#x8EAB;&#x7684;&#x903B;&#x8F91;&#x662F;&#x5426;&#x5408;&#x7406;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x8003;&#x8651;&#x6267;&#x884C;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x4F8B;&#x5982;&#x4E70;&#x5165;&#x5230;&#x5E95;&#x662F;&#x4E70;&#x5F00;&#x8FD8;&#x662F;&#x4E70;&#x5E73;&#xFF1F;&#x5356;&#x51FA;&#x5230;&#x5E95;&#x662F;&#x5356;&#x5F00;&#x8FD8;&#x662F;&#x5356;&#x5E73;&#xFF1F;&#x5982;&#x4F55;&#x5904;&#x7406;&#x5E73;&#x4ECA;&#x548C;&#x5E73;&#x6628;&#x7684;&#x4F63;&#x91D1;&#x5DEE;&#x522B;&#xFF1F;&#x5230;&#x5E95;&#x662F;&#x53CC;&#x5F00;&#x8FD8;&#x662F;&#x9501;&#x4ED3;&#xFF1F;
  &#x6267;&#x884C;&#x5668;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EA;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x7B97;&#x6CD5;&#x4EA4;&#x6613;&#x7684;&#x5177;&#x4F53;&#x903B;&#x8F91;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x7B56;&#x7565;&#x5982;&#x4F55;&#x8C03;&#x7528;&#xFF0C;&#x8BA2;&#x5355;&#x8981;&#x4E0D;&#x8981;&#x56DE;&#x62A5;&#x7ED9;&#x7B56;&#x7565;&#x5904;&#x7406;&#x3002;</p>
</li>
<li><p>&#x6838;&#x5FC3;&#x6A21;&#x5757;&#x7528;C++&#x5F00;&#x53D1;&#xFF0C;&#x76F8;&#x6BD4;&#x5176;&#x4ED6;&#x89E3;&#x91CA;&#x578B;&#x8BED;&#x8A00;&#xFF0C;&#x6267;&#x884C;&#x6548;&#x7387;&#x66F4;&#x6709;&#x4FDD;&#x8BC1;&#x3002;
  <em>C/C++</em>&#x662F;&#x504F;&#x5E95;&#x5C42;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5728;&#x5185;&#x5B58;&#x63A7;&#x5236;&#x548C;&#x6267;&#x884C;&#x6548;&#x7387;&#x4E0A;&#x62E5;&#x6709;&#x66F4;&#x5927;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x867D;&#x7136;&#x4E0D;&#x50CF;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x6709;&#x90A3;&#x4E48;&#x591A;&#x8BED;&#x6CD5;&#x7CD6;&#xFF0C;&#x4F46;&#x662F;&#x6210;&#x719F;&#x7684;&#x793E;&#x533A;&#x73AF;&#x5883;&#xFF0C;&#x53EF;&#x4EE5;&#x4FDD;&#x969C;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#x7684;&#x903B;&#x8F91;&#x80FD;&#x591F;&#x6709;&#x5F88;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x6838;&#x5FC3;&#x90E8;&#x5206;&#x7531;&#x4E13;&#x95E8;&#x7684;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x6765;&#x5F00;&#x53D1;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x76F8;&#x6BD4;&#x8D77;&#x5176;&#x4ED6;&#x76F4;&#x63A5;&#x7528;&#x89E3;&#x91CA;&#x578B;&#x8BED;&#x8A00;&#x5F00;&#x53D1;&#x6838;&#x5FC3;&#x903B;&#x8F91;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;C++&#x7684;&#x6838;&#x5FC3;&#x6A21;&#x5757;&#x663E;&#x7136;&#x66F4;&#x6709;&#x4F18;&#x52BF;&#x3002;</p>
</li>
<li><p>&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x843D;&#x5730;&#x7A0B;&#x5E8F;+N&#x4E2A;&#x7EC4;&#x5408;&#x76D8;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x90E8;&#x7F72;&#x548C;&#x7BA1;&#x7406;&#x90FD;&#x6781;&#x4E3A;&#x65B9;&#x4FBF;
  <em>WonderTrader</em>&#x7684;&#x6570;&#x636E;&#x7EC4;&#x4EF6;&#xFF0C;&#x5185;&#x7F6E;&#x4E00;&#x4E2A;UDP&#x5E7F;&#x64AD;&#x670D;&#x52A1;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5C06;&#x63A5;&#x6536;&#x5230;&#x7684;&#x884C;&#x60C5;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5E7F;&#x64AD;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6570;&#x636E;&#x7EC4;&#x4EF6;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x7ED9;&#x591A;&#x4E2A;&#x7EC4;&#x5408;&#x76D8;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x670D;&#x52A1;&#x3002;
  &#x5185;&#x7F6E;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x6A21;&#x5757;&#xFF0C;&#x91C7;&#x7528;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x6587;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#x8BFB;&#x5199;&#x6587;&#x4EF6;&#xFF0C;&#x4ECE;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x964D;&#x4F4E;&#x4E86;&#x6570;&#x636E;&#x8BFB;&#x5199;&#x7684;&#x5F00;&#x9500;&#x3002;&#x800C;&#x4E14;&#x91C7;&#x7528;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x6587;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5E94;&#x5BF9;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x8BFB;&#x53D6;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x3002;</p>
</li>
<li><p>C&#x63A5;&#x53E3;&#x5BFC;&#x51FA;&#xFF0C;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x8DE8;&#x8BED;&#x8A00;&#x7684;&#x8C03;&#x7528;
  <em>WonderTrader</em>&#x7684;&#x9879;&#x76EE;&#x7ED3;&#x6784;&#xFF0C;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x9075;&#x5FAA;&#x9759;&#x6001;&#x6838;&#x5FC3;&#x5E93;+&#x52A8;&#x6001;C&#x5E93;&#x3002;&#x5982;&#x679C;&#x5728;C++&#x73AF;&#x5883;&#x4E0B;&#x8FD0;&#x884C;&#xFF0C;&#x5219;&#x76F4;&#x63A5;&#x7531;&#x53EF;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x94FE;&#x63A5;&#x9759;&#x6001;&#x6838;&#x5FC3;&#x5E93;&#x5373;&#x53EF;&#x3002;&#x5982;&#x679C;&#x5728;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x4E0B;&#x8C03;&#x7528;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x8C03;&#x7528;C&#x63A5;&#x53E3;&#x5BFC;&#x51FA;&#x7684;&#x52A8;&#x6001;&#x5E93;&#x3002;
  C&#x63A5;&#x53E3;&#x5BFC;&#x51FA;&#x7684;&#x52A8;&#x6001;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x8DE8;&#x8BED;&#x8A00;&#x8C03;&#x7528;&#x7684;&#x573A;&#x666F;&#x3002;<em>WonderTrader</em>&#x7684;<em>python</em>&#x5B50;&#x6846;&#x67B6;<strong><em>wtpy</em></strong>&#x5C31;&#x662F;&#x5BF9;<em>python3</em>&#x73AF;&#x5883;&#x4E0B;&#x8C03;&#x7528;WonderTrader&#x7684;&#x4E00;&#x79CD;&#x5B9E;&#x8DF5;&#x3002;&#x6709;&#x9700;&#x6C42;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x8981;&#x81EA;&#x884C;&#x5F00;&#x53D1;&#x5B50;&#x6846;&#x67B6;&#xFF0C;&#x4F8B;&#x5982;<code>C#</code>&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>DllImport</code>&#x5BFC;&#x51FA;C&#x5E93;&#xFF0C;&#x800C;<code>python</code>&#x5219;&#x4F7F;&#x7528;<code>ctypes</code>&#x5E93;&#x8C03;&#x7528;C&#x5E93;&#xFF0C;<code>java</code>&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<code>JNI</code>&#x8C03;&#x7528;C&#x5E93;&#x3002;</p>
</li>
</ul>
<h4 id="where---wondertrader&#x600E;&#x4E48;&#x83B7;&#x53D6;"><em>Where</em> - <em>WonderTrader</em>&#x600E;&#x4E48;&#x83B7;&#x53D6;</h4>
<hr>
<ul>
<li><p><em>WonderTrader</em>&#x7684;<em>github</em>&#x5730;&#x5740;&#xFF1A;<a href="https://github.com/wondertrader/wondertrader" target="_blank">https://github.com/wondertrader/wondertrader</a></p>
</li>
<li><p><em>WonderTrader</em>&#x7684;<em>Python3</em>&#x5B50;&#x6846;&#x67B6;<em>wtpy</em>&#x83B7;&#x53D6;&#x5730;&#x5740;&#xFF1A;<a href="https://pypi.org/project/wtpy/" target="_blank">https://pypi.org/project/wtpy/</a>
  <em>wtpy</em>&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5728;<em>python3.5</em>&#x4EE5;&#x4E0A;&#x7684;&#x7248;&#x672C;&#x5B89;&#x88C5;</p>
<pre><code class="lang-json">  pip install wtpy
</code></pre>
</li>
</ul>
<h4 id="how---wondertrader&#x7684;&#x7528;&#x6CD5;"><em>How</em> - <em>WonderTrader</em>&#x7684;&#x7528;&#x6CD5;</h4>
<hr>
<ul>
<li>Demo&#x600E;&#x4E48;&#x8FD0;&#x884C;
  github&#x4E0A;&#x63D0;&#x4F9B;&#x4E86;<em>WonderTrader</em>&#x5B50;&#x6846;&#x67B6;<strong><em>wtpy</em></strong>&#x7684;&#x4F7F;&#x7528;&#x7528;&#x4F8B;<br>  <a href="https://github.com/wondertrader/wondertrader/tree/master/demos/py" target="_blank">https://github.com/wondertrader/wondertrader/tree/master/demos/py</a>
  &#x5B89;&#x88C5;&#x4E86;<strong><em>wtpy</em></strong>&#x4EE5;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x56DE;&#x6D4B;demo
  &#x5982;&#x679C;&#x8981;&#x8FD0;&#x884C;&#x6570;&#x636E;demo&#x548C;&#x5B9E;&#x76D8;demo&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x5408;&#x7EA6;&#x5217;&#x8868;&#x66F4;&#x65B0;&#x5230;&#x6700;&#x65B0;&#xFF08;&#x671F;&#x8D27;demo&#x4E2D;&#x662F;contracts.json&#xFF0C;&#x80A1;&#x7968;demo&#x4E2D;&#x662F;stocks.json&#xFF09;</li>
</ul>
<h4 id="&#x5199;&#x5728;&#x6700;&#x540E;">&#x5199;&#x5728;&#x6700;&#x540E;</h4>
<hr>
<ul>
<li>WonderTrader&#x662F;&#x7ECF;&#x8FC7;&#x591A;&#x5E74;&#x68C0;&#x9A8C;&#x7684;&#x6210;&#x719F;&#x91CF;&#x5316;&#x4EA4;&#x6613;&#x6846;&#x67B6;&#xFF0C;&#x4ECE;2013&#x5E74;&#x5F00;&#x59CB;&#x642D;&#x5EFA;&#x7B2C;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x5230;&#x73B0;&#x5728;&#xFF0C;&#x7ECF;&#x5386;&#x8FC7;&#x51E0;&#x6B21;&#x5168;&#x90E8;&#x91CD;&#x6784;&#xFF0C;&#x6700;&#x7EC8;&#x5F62;&#x6210;&#x5982;&#x4ECA;&#x7684;WonderTrader</li>
<li>&#x5173;&#x6CE8;&#x516C;&#x4F17;&#x53F7;wondertrader&#xFF0C;&#x53EF;&#x4EE5;&#x6536;&#x5230;wondertrader&#x7684;&#x5B9E;&#x65F6;&#x8D44;&#x8BAF;</li>
</ul>
<p><img src="http://q92ex9g0c.bkt.clouddn.com/wt/logo_qcode_ad.jpg" alt="WonderTrader2.png"></p>

                                
                                </section>
                            
                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"WonderTrader简介","level":"1.1","depth":1,"next":{"title":"基本用法","level":"1.2","depth":1,"ref":"","articles":[{"title":"快速入门","level":"1.2.1","depth":2,"path":"tutorial.md","ref":"tutorial.md","articles":[]},{"title":"如何编译和安装","level":"1.2.2","depth":2,"path":"install.md","ref":"install.md","articles":[]},{"title":"历史数据的处理","level":"1.2.3","depth":2,"path":"histdata.md","ref":"histdata.md","articles":[]},{"title":"回测自己的策略","level":"1.2.4","depth":2,"path":"mystrategy.md","ref":"mystrategy.md","articles":[]},{"title":"实盘完整攻略","level":"1.2.5","depth":2,"path":"product.md","ref":"product.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["-search","github","github-buttons","livereload"],"styles":{"website":"./styles/website.css"},"pluginsConfig":{"github":{"url":"https://github.com/wondertrader/wondertrader"},"github-buttons":{"buttons":[{"user":"wondertrader","repo":"wondertrader","type":"star","size":"small","count":true}]},"livereload":{},"highlight":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"all":["facebook","google","twitter","weibo","instapaper"],"facebook":true,"google":false,"instapaper":false,"twitter":true,"vk":false,"weibo":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"WonderTrader","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"WonderTrader-组合盘管理的利器","language":"zh-hans","links":{"sidebar":{"官网":"https://wondertrader.github.io"}},"gitbook":"3.2.3","description":"Documents of WonderTrader"},"file":{"path":"README.md","mtime":"2020-04-29T06:34:15.183Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-05-12T09:32:43.814Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github-buttons/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

